 gdb ./problem03.exe
GNU gdb (GDB) 7.6.1
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "mingw32".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from C:\Users\Dheeraj\Psc\c-activity-sets\set01\problem03.exe...done.
(gdb) b main
Breakpoint 1 at 0x4014d8: file problem03.c, line 25.
(gdb) n
The program is not being run.
(gdb) r
Starting program: C:\Users\Dheeraj\Psc\c-activity-sets\set01/./problem03.exe
[New Thread 11972.0x5440]
[New Thread 11972.0x4290]

Breakpoint 1, main () at problem03.c:25
25      a=input();
(gdb) n
Enter the numbers 2
26      b=input();
(gdb) 2
Undefined command: "2".  Try "help".
(gdb) n
Enter the numbers4
27      c= add(a,b);
(gdb) n
28      output(a,b,c);
(gdb) c
Continuing.
The sum of 2 and 4 is 6[Inferior 1 (process 11972) exited normally]
(gdb) q
PS C:\Users\Dheeraj\Psc\c-activity-sets\set01> 